
&НаКлиенте
Процедура ТабличнаяЧасть1ФИОПриИзменении(Элемент)
ТекДанные=Элементы.ТабличнаяЧасть1.ТекущиеДанные;
ТекДанные.Оклад=СотрудникиОкладСотрудникаПриИзмененииНаСервере(ТекДанные.ФИО); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция СотрудникиОкладСотрудникаПриИзмененииНаСервере(ФИО)
Возврат ФИО.ОкладСотрудника;
КонецФункции


&НаКлиенте
Процедура ТабличнаяЧасть1ДоВычетаНДФЛПриИзменении(Элемент)
ТекДанные = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
ТекДанные.ДоВычетаНДФЛ = ТекДанные.Оклад+ТекДанные.Премия

КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1ОкладПриИзменении(Элемент)
	ТекДанные = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	ТекДанные.ДоВычетаНДФЛ = ТекДанные.Оклад+ТекДанные.Премия
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1ПремияПриИзменении(Элемент)
	ТекДанные = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	ТекДанные.ДоВычетаНДФЛ = ТекДанные.Оклад+ТекДанные.Премия
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1ЗППриИзменении(Элемент)
	ТекДанные = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	ТекДанные.ЗП = ТекДанные.ДоВычетаНДФЛ - ТекДанные.ДоВычетаНДФЛ * ТекДанные.НДФЛ/100
КонецПроцедуры


&НаКлиенте
Процедура ТабличнаяЧасть1ПриИзменении(Элемент)
	ТекДанные = Элементы.ТабличнаяЧасть1.ТекущиеДанные;
	ТекДанные.ЗП = ТекДанные.ДоВычетаНДФЛ - ТекДанные.ДоВычетаНДФЛ * ТекДанные.НДФЛ/100
КонецПроцедуры

